app/views/books/index.html.erb

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
						<td>
							<%= link_to "コメント数#{book.book_comments.count}", book_path(book) %>