app/controllers/book_comments_controller.rb

  def create
    book = Book.find(params[:book_id])
    comment = BookComment.new(book_comment_params)
    comment.user_id = current_user.id
    comment.book_id = book.id
    comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "うおおおおおおおおおおおおおおお最強！"], ["user_id", 2], ["book_id", 1], ["created_at", "2020-11-02 13:24:05.267481"], ["updated_at", "2020-11-02 13:24:05.267481"]]